# Pandas
* ### Pandas is an open source library built on the top of numpy
* ### It allows for fast analysis,data cleaning and preparation.
* ### It can work with data from variety of sources.

## Discussion Topics
* #### Series
* #### Dataframe
* #### Missing Data
* #### Groupby
* #### Merging,joining and concatenation
* #### Basic operations

##### So let's get started

In [14]:
import numpy as np
from numpy.random import randn
import pandas as pd

In [15]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [16]:
#using list
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [17]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [18]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(arr) # numpy arrays

0    10
1    20
2    30
dtype: int32

In [20]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [21]:
pd.Series(d) #dictionary

a    10
b    20
c    30
dtype: int64

In [80]:
#np.random.seed(101)

#### Dataframe
 We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [23]:
df = pd.DataFrame(randn(4,5),['a','b','c','d'],['w','x','y','z','n'])

In [24]:
df

          w         x         y         z         n
a  1.578404  0.588193  2.021358 -0.058038 -0.673535
b -1.064361  1.662627 -0.394423  2.192868 -1.028678
c  0.470887 -1.293944 -1.782134 -1.402345 -1.755947
d -0.603488  0.050532  1.165474  0.213873  1.123511

In [31]:
type(df['w'])

pandas.core.series.Series

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df[['w','x','y']]

          w         x         y
a -0.814217  0.122141 -0.692537
b -0.817430 -1.313184  1.287555
c  1.364853 -0.612919  0.280193
d  0.086185 -0.002266 -0.828965

In [19]:
df.w

a   -0.814217
b   -0.817430
c    1.364853
d    0.086185
Name: w, dtype: float64

In [20]:
df['new'] = df['w']

In [21]:
df

          w         x         y         z         n       new
a -0.814217  0.122141 -0.692537 -1.278333 -1.391211 -0.814217
b -0.817430 -1.313184  1.287555  0.341011 -1.159960 -0.817430
c  1.364853 -0.612919  0.280193 -1.524733 -1.404796  1.364853
d  0.086185 -0.002266 -0.828965  1.456636  0.606009  0.086185

In [22]:
df.drop('new',axis = 1)

          w         x         y         z         n
a -0.814217  0.122141 -0.692537 -1.278333 -1.391211
b -0.817430 -1.313184  1.287555  0.341011 -1.159960
c  1.364853 -0.612919  0.280193 -1.524733 -1.404796
d  0.086185 -0.002266 -0.828965  1.456636  0.606009

In [23]:
df.shape

(4, 6)

In [24]:
df

          w         x         y         z         n       new
a -0.814217  0.122141 -0.692537 -1.278333 -1.391211 -0.814217
b -0.817430 -1.313184  1.287555  0.341011 -1.159960 -0.817430
c  1.364853 -0.612919  0.280193 -1.524733 -1.404796  1.364853
d  0.086185 -0.002266 -0.828965  1.456636  0.606009  0.086185

In [25]:
df.shape

(4, 6)

In [26]:
df.drop('new',axis = 1)

          w         x         y         z         n
a -0.814217  0.122141 -0.692537 -1.278333 -1.391211
b -0.817430 -1.313184  1.287555  0.341011 -1.159960
c  1.364853 -0.612919  0.280193 -1.524733 -1.404796
d  0.086185 -0.002266 -0.828965  1.456636  0.606009

In [27]:
df

          w         x         y         z         n       new
a -0.814217  0.122141 -0.692537 -1.278333 -1.391211 -0.814217
b -0.817430 -1.313184  1.287555  0.341011 -1.159960 -0.817430
c  1.364853 -0.612919  0.280193 -1.524733 -1.404796  1.364853
d  0.086185 -0.002266 -0.828965  1.456636  0.606009  0.086185

In [28]:
df = df.drop('new',axis = 1)

In [29]:
df

          w         x         y         z         n
a -0.814217  0.122141 -0.692537 -1.278333 -1.391211
b -0.817430 -1.313184  1.287555  0.341011 -1.159960
c  1.364853 -0.612919  0.280193 -1.524733 -1.404796
d  0.086185 -0.002266 -0.828965  1.456636  0.606009

In [30]:
df.loc['c']

pandas.core.series.Series

In [31]:
df.iloc[2]   #index based location

w    1.364853
x   -0.612919
y    0.280193
z   -1.524733
n   -1.404796
Name: c, dtype: float64

In [32]:
df.loc['b','y']

1.287555386846403

In [33]:
df.loc[['b','c'],['y','z']]

          y         z
b  1.287555  0.341011
c  0.280193 -1.524733

### Data frame continued

In [36]:
df

          w         x         y         n
a  1.578404  0.588193  2.021358 -0.673535
b -1.064361  1.662627 -0.394423 -1.028678
c  0.470887 -1.293944 -1.782134 -1.755947
d -0.603488  0.050532  1.165474  1.123511

In [37]:
df>0

       w      x      y      n
a   True   True   True  False
b  False   True  False  False
c   True  False  False  False
d  False   True   True   True

In [38]:
df['w']>0

a     True
b    False
c     True
d    False
Name: w, dtype: bool

In [39]:
df

          w         x         y         n
a  1.578404  0.588193  2.021358 -0.673535
b -1.064361  1.662627 -0.394423 -1.028678
c  0.470887 -1.293944 -1.782134 -1.755947
d -0.603488  0.050532  1.165474  1.123511

In [40]:
df[df['w']>0]

          w         x         y         n
a  1.578404  0.588193  2.021358 -0.673535
c  0.470887 -1.293944 -1.782134 -1.755947

In [41]:
df[df['w']>0]['x']

a    0.588193
c   -1.293944
Name: x, dtype: float64

In [45]:
df[df['w']>0][['x','y']]

          x         y
a  0.588193  2.021358
c -1.293944 -1.782134

In [46]:
check= df['w']>0           #broken into many steps
result = df[check]
columns = ['x','y']
newdf = result[columns]
newdf

          x         y
a  0.588193  2.021358
c -1.293944 -1.782134

In [47]:
booldf = df>0

In [48]:
booldf

       w      x      y      n
a   True   True   True  False
b  False   True  False  False
c   True  False  False  False
d  False   True   True   True

In [49]:
df[booldf]

          w         x         y         n
a  1.578404  0.588193  2.021358       NaN
b       NaN  1.662627       NaN       NaN
c  0.470887       NaN       NaN       NaN
d       NaN  0.050532  1.165474  1.123511

In [50]:
df['w']>0

a     True
b    False
c     True
d    False
Name: w, dtype: bool

In [51]:
df[df['w']>0]  #conditional selection

          w         x         y         n
a  1.578404  0.588193  2.021358 -0.673535
c  0.470887 -1.293944 -1.782134 -1.755947

In [52]:
df[(df['w']>0) & (df['x']<0)]    #multiple conditions

          w         x         y         n
c  0.470887 -1.293944 -1.782134 -1.755947

In [53]:
df[(df['w']>0) | (df['x']<0)]

          w         x         y         n
a  1.578404  0.588193  2.021358 -0.673535
c  0.470887 -1.293944 -1.782134 -1.755947

In [54]:
a = df.reset_index()

In [55]:
a

  index         w         x         y         n
0     a  1.578404  0.588193  2.021358 -0.673535
1     b -1.064361  1.662627 -0.394423 -1.028678
2     c  0.470887 -1.293944 -1.782134 -1.755947
3     d -0.603488  0.050532  1.165474  1.123511

In [56]:
df

          w         x         y         n
a  1.578404  0.588193  2.021358 -0.673535
b -1.064361  1.662627 -0.394423 -1.028678
c  0.470887 -1.293944 -1.782134 -1.755947
d -0.603488  0.050532  1.165474  1.123511

In [57]:
newlist = '1 2 3 4'.split()

In [58]:
newlist

['1', '2', '3', '4']

In [59]:
df['SN'] = newlist

In [60]:
df

          w         x         y         n SN
a  1.578404  0.588193  2.021358 -0.673535  1
b -1.064361  1.662627 -0.394423 -1.028678  2
c  0.470887 -1.293944 -1.782134 -1.755947  3
d -0.603488  0.050532  1.165474  1.123511  4

In [61]:
df.set_index('SN')

           w         x         y         n
SN
1   1.578404  0.588193  2.021358 -0.673535
2  -1.064361  1.662627 -0.394423 -1.028678
3   0.470887 -1.293944 -1.782134 -1.755947
4  -0.603488  0.050532  1.165474  1.123511

In [62]:
df.drop('y',axis =1,inplace = True)

In [63]:
df.set_index('SN',inplace = True)

In [64]:
df

           w         x         n
SN
1   1.578404  0.588193 -0.673535
2  -1.064361  1.662627 -1.028678
3   0.470887 -1.293944 -1.755947
4  -0.603488  0.050532  1.123511

In [65]:
df.shape

(4, 3)

# MultiIndex

In [68]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [69]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [71]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.009396 -0.433541
   2  0.595053 -1.061042
   3  0.060496  0.019805
G2 1  0.010281  0.756624
   2  0.133668  0.327726
   3 -1.274064  1.807030

In [72]:
df.loc['G1']

          A         B
1 -0.009396 -0.433541
2  0.595053 -1.061042
3  0.060496  0.019805

In [73]:
df.loc['G1'].loc[1]

A   -0.009396
B   -0.433541
Name: 1, dtype: float64

In [74]:
df.index.names

FrozenList([None, None])

In [75]:
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1   -0.009396 -0.433541
      2    0.595053 -1.061042
      3    0.060496  0.019805
G2    1    0.010281  0.756624
      2    0.133668  0.327726
      3   -1.274064  1.807030

In [76]:
df.xs('G1')

            A         B
Num
1   -0.009396 -0.433541
2    0.595053 -1.061042
3    0.060496  0.019805

In [77]:
df.xs(['G1',1])

A   -0.009396
B   -0.433541
Name: (G1, 1), dtype: float64

In [78]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.009396 -0.433541
G2     0.010281  0.756624

## Missing data

In [79]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [80]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [81]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [82]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [83]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [84]:
df.fillna(value='VALUE')

       A      B  C
0      1      5  1
1      2  VALUE  2
2  VALUE  VALUE  3

In [85]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby

In [86]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [87]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

#### Now you can use the .groupby() method to group rows together based off of a column name.

In [88]:
df.groupby('Company')

In [89]:
by_comp = df.groupby("Company")

In [90]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [91]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [92]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [93]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [94]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [95]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [96]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

#### Merging joining and concatenation

In [97]:
# dataframes

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [98]:
# concatenation

pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [100]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [101]:
#Dataframes

left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

#### Merging

In [102]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [103]:
# more complicated example
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [104]:
pd.merge(left, right, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [61]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [62]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [63]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

#### joining

In [64]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [65]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [66]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

##### Pivot table

In [67]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [68]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN